Merge pull request #206 from bisensamiksha/feature/s4-30-architecture-decision-records
chore(s4-30): diagram the architecture
